In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("../data/market-price.csv", header=None, 
            names = ["date", "price"])

In [28]:
df.shape[0]

365

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
date     365 non-null object
price    365 non-null float64
dtypes: float64(1), object(1)
memory usage: 5.8+ KB

In [17]:
df.dtypes

date      object
price    float64
dtype: object

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.head()

                  date   price
0  2016-04-18 00:00:00  427.28
1  2016-04-19 00:00:00  435.91
2  2016-04-20 00:00:00  442.34
3  2016-04-21 00:00:00  451.00
4  2016-04-22 00:00:00  447.25

In [20]:
df.sample(10)

                    date        price
38   2016-05-26 00:00:00   452.490000
180  2016-10-15 00:00:00   637.949857
331  2017-03-15 00:00:00  1257.399625
315  2017-02-27 00:00:00  1190.751950
210  2016-11-14 00:00:00   706.467875
355  2017-04-08 00:00:00  1181.149838
114  2016-08-10 00:00:00   592.189900
94   2016-07-21 00:00:00   664.882075
357  2017-04-10 00:00:00  1207.744875
61   2016-06-18 00:00:00   754.366250

In [22]:
type(df["price"])

pandas.core.series.Series

In [23]:
df["price"].min()

427.27999999999997

In [24]:
df["price"].max()

1285.1400000000001

In [25]:
df["price"].mean(), df["price"].median()

(756.44382290280498, 676.3294375)

In [29]:
df[10:15]

                   date   price
10  2016-04-28 00:00:00  450.00
11  2016-04-29 00:00:00  456.16
12  2016-04-30 00:00:00  447.17
13  2016-05-01 00:00:00  451.90
14  2016-05-02 00:00:00  443.90

In [31]:
df[["price", "date"]]

           price                 date
0     427.280000  2016-04-18 00:00:00
1     435.910000  2016-04-19 00:00:00
2     442.340000  2016-04-20 00:00:00
3     451.000000  2016-04-21 00:00:00
4     447.250000  2016-04-22 00:00:00
5     451.290000  2016-04-23 00:00:00
6     459.400000  2016-04-24 00:00:00
7     463.860000  2016-04-25 00:00:00
8     467.980000  2016-04-26 00:00:00
9     447.310000  2016-04-27 00:00:00
10    450.000000  2016-04-28 00:00:00
11    456.160000  2016-04-29 00:00:00
12    447.170000  2016-04-30 00:00:00
13    451.900000  2016-05-01 00:00:00
14    443.900000  2016-05-02 00:00:00
15    450.960000  2016-05-03 00:00:00
16    447.370000  2016-05-04 00:00:00
17    448.510000  2016-05-05 00:00:00
18    460.910000  2016-05-06 00:00:00
19    459.040000  2016-05-07 00:00:00
20    457.820000  2016-05-08 00:00:00
21    461.630000  2016-05-09 00:00:00
22    450.000000  2016-05-10 00:00:00
23    452.510000  2016-05-11 00:00:00
24    454.700000  2016-05-12 00:00:00
25    456.820000  2016-05-13 00:00:00
26    455.650000  2016-05-14 00:00:00
27    457.080000  2016-05-15 00:00:00
28    454.880000  2016-05-16 00:00:00
29    452.890000  2016-05-17 00:00:00
..           ...                  ...
335  1029.800812  2017-03-19 00:00:00
336  1049.084488  2017-03-20 00:00:00
337  1118.630043  2017-03-21 00:00:00
338  1028.726862  2017-03-22 00:00:00
339  1038.789000  2017-03-23 00:00:00
340   941.919714  2017-03-24 00:00:00
341   959.340086  2017-03-25 00:00:00
342   956.786313  2017-03-26 00:00:00
343  1037.229250  2017-03-27 00:00:00
344  1046.127625  2017-03-28 00:00:00
345  1040.575500  2017-03-29 00:00:00
346  1037.904550  2017-03-30 00:00:00
347  1079.549314  2017-03-31 00:00:00
348  1086.929571  2017-04-01 00:00:00
349  1099.169125  2017-04-02 00:00:00
350  1141.813000  2017-04-03 00:00:00
351  1141.600363  2017-04-04 00:00:00
352  1133.079314  2017-04-05 00:00:00
353  1196.307937  2017-04-06 00:00:00
354  1190.454250  2017-04-07 00:00:00
355  1181.149838  2017-04-08 00:00:00
356  1208.800500  2017-04-09 00:00:00
357  1207.744875  2017-04-10 00:00:00
358  1226.617037  2017-04-11 00:00:00
359  1218.922050  2017-04-12 00:00:00
360  1180.023713  2017-04-13 00:00:00
361  1185.260057  2017-04-14 00:00:00
362  1184.880671  2017-04-15 00:00:00
363  1186.927412  2017-04-16 00:00:00
364  1205.634875  2017-04-17 00:00:00

[365 rows x 2 columns]

In [36]:
df.iloc[10:15, 0:2]

                   date   price
10  2016-04-28 00:00:00  450.00
11  2016-04-29 00:00:00  456.16
12  2016-04-30 00:00:00  447.17
13  2016-05-01 00:00:00  451.90
14  2016-05-02 00:00:00  443.90

# Exercise 1: 

Find out: 
    1. number of records
    2. no of columns 
    3. min, max and median Salary
    4. display row 5 to 7 for all columns
    5. display Country and Purchase columns

In [5]:
data = pd.read_csv("../data/Data.csv")
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [132]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [40]:
data.shape

(10, 4)

In [41]:
data["Salary"]

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

In [42]:
data.iloc[:, 2]

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

In [46]:
c = data["Salary"]

In [60]:
c.min(), c.max(), c.median()

(48000.0, 83000.0, 61000.0)

In [61]:
data[5:8]

  Country   Age   Salary Purchased
5  France  35.0  58000.0       Yes
6   Spain   NaN  52000.0        No
7  France  48.0  79000.0       Yes

In [63]:
data.iloc[5:8, [0, 3]]

  Country Purchased
5  France       Yes
6   Spain        No
7  France       Yes

In [64]:
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [65]:
data.iloc[:, [0, 3]]

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [66]:
data[["Country", "Purchased"]]

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [68]:
data["Country"].apply(lambda s:s.upper())

0     FRANCE
1      SPAIN
2    GERMANY
3      SPAIN
4    GERMANY
5     FRANCE
6      SPAIN
7     FRANCE
8    GERMANY
9     FRANCE
Name: Country, dtype: object

In [69]:
data["COUNTRY"] = data["Country"].apply(lambda s:s.upper())

In [70]:
data

   Country   Age   Salary Purchased  COUNTRY
0   France  44.0  72000.0        No   FRANCE
1    Spain  27.0  48000.0       Yes    SPAIN
2  Germany  30.0  54000.0        No  GERMANY
3    Spain  38.0  61000.0        No    SPAIN
4  Germany  40.0      NaN       Yes  GERMANY
5   France  35.0  58000.0       Yes   FRANCE
6    Spain   NaN  52000.0        No    SPAIN
7   France  48.0  79000.0       Yes   FRANCE
8  Germany  50.0  83000.0        No  GERMANY
9   France  37.0  67000.0       Yes   FRANCE

In [72]:
data["SalAge"] = data.apply(lambda row: row["Salary"] + row["Age"], 
                            axis = 1)

In [73]:
data

   Country   Age   Salary Purchased  COUNTRY   SalAge
0   France  44.0  72000.0        No   FRANCE  72044.0
1    Spain  27.0  48000.0       Yes    SPAIN  48027.0
2  Germany  30.0  54000.0        No  GERMANY  54030.0
3    Spain  38.0  61000.0        No    SPAIN  61038.0
4  Germany  40.0      NaN       Yes  GERMANY      NaN
5   France  35.0  58000.0       Yes   FRANCE  58035.0
6    Spain   NaN  52000.0        No    SPAIN      NaN
7   France  48.0  79000.0       Yes   FRANCE  79048.0
8  Germany  50.0  83000.0        No  GERMANY  83050.0
9   France  37.0  67000.0       Yes   FRANCE  67037.0

In [74]:
del(data["COUNTRY"])

In [76]:
del(data["SalAge"])

In [77]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [78]:
data.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [81]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [80]:
data.dropna(axis=1)

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [82]:
data.fillna(data.mean())

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [84]:
data["Age"].mean(), data["Salary"].mean()

(38.777777777777779, 63777.777777777781)

In [85]:
data.mean()

Age          38.777778
Salary    63777.777778
dtype: float64

In [87]:
data.fillna({"Age": 38.0,"Salary": 63777})

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63777.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [88]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [93]:
data["Age"].values

array([ 44.,  27.,  30.,  38.,  40.,  35.,  nan,  48.,  50.,  37.])

In [101]:
d1 = pd.DataFrame({"date": ["2016-03-23", "2015-08-15"]})

In [97]:
from datetime import datetime, date, time

In [100]:
datetime.strptime("2016-03-23", "%Y-%m-%d").date()

datetime.date(2016, 3, 23)

In [104]:
d1["date_type"] = d1.apply(lambda row: datetime.strptime(row["date"], "%Y-%m-%d"), axis = 1)

In [105]:
d1

         date  date_type
0  2016-03-23 2016-03-23
1  2015-08-15 2015-08-15

In [106]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
date         2 non-null object
date_type    2 non-null datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 112.0+ bytes

In [107]:
d1["date_type"] = d1["date"].apply(lambda row: 
                                   datetime.strptime(row, "%Y-%m-%d"))

In [108]:
d1

         date  date_type
0  2016-03-23 2016-03-23
1  2015-08-15 2015-08-15

In [110]:
data = data.fillna(data.mean())

In [111]:
data

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [113]:
data["Purchased"].value_counts()

No     5
Yes    5
Name: Purchased, dtype: int64

In [115]:
data.median()

Age          38.388889
Salary    62388.888889
dtype: float64

In [116]:
data.groupby("Country").median()

          Age        Salary
Country
France   40.5  69500.000000
Germany  40.0  63777.777778
Spain    38.0  52000.000000

In [117]:
data.groupby("Country")["Age"].median()

Country
France     40.5
Germany    40.0
Spain      38.0
Name: Age, dtype: float64

In [119]:
import numpy as np

In [120]:
data.groupby("Country")["Age"].agg([np.mean, np.median])

              mean  median
Country
France   41.000000    40.5
Germany  40.000000    40.0
Spain    34.592593    38.0

In [124]:
data.groupby("Country").agg({"Age": np.mean, "Salary": np.median})

               Age        Salary
Country
France   41.000000  69500.000000
Germany  40.000000  63777.777778
Spain    34.592593  52000.000000

In [136]:
data.groupby(["Country", "Purchased"]).mean()

                    Age   Salary
Country Purchased
France  No         44.0  72000.0
        Yes        40.0  68000.0
Germany No         40.0  68500.0
        Yes        40.0      NaN
Spain   No         38.0  56500.0
        Yes        27.0  48000.0

In [154]:
#data.columns = [c.lower() for c in data.columns]
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
data = data.fillna(data.median())

In [7]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [8]:
data2 =  pd.get_dummies(data, columns=["Country"])

In [9]:
del(data2["Purchased"])

In [10]:
pd.DataFrame(data2.values)

      0        1    2    3    4
0  44.0  72000.0  1.0  0.0  0.0
1  27.0  48000.0  0.0  0.0  1.0
2  30.0  54000.0  0.0  1.0  0.0
3  38.0  61000.0  0.0  0.0  1.0
4  40.0  61000.0  0.0  1.0  0.0
5  35.0  58000.0  1.0  0.0  0.0
6  38.0  52000.0  0.0  0.0  1.0
7  48.0  79000.0  1.0  0.0  0.0
8  50.0  83000.0  0.0  1.0  0.0
9  37.0  67000.0  1.0  0.0  0.0

In [12]:
from sklearn.preprocessing import StandardScaler

In [13]:
ss = StandardScaler()
data2_std = ss.fit_transform(data2.values)

In [14]:
pd.DataFrame(data2_std, columns = data2.columns)

        Age    Salary  Country_France  Country_Germany  Country_Spain
0  0.769734  0.772568        1.224745        -0.654654      -0.654654
1 -1.699225 -1.408800       -0.816497        -0.654654       1.527525
2 -1.263526 -0.863458       -0.816497         1.527525      -0.654654
3 -0.101663 -0.227226       -0.816497        -0.654654       1.527525
4  0.188803 -0.227226       -0.816497         1.527525      -0.654654
5 -0.537362 -0.499897        1.224745        -0.654654      -0.654654
6 -0.101663 -1.045239       -0.816497        -0.654654       1.527525
7  1.350666  1.408800        1.224745        -0.654654      -0.654654
8  1.641132  1.772361       -0.816497         1.527525      -0.654654
9 -0.246896  0.318116        1.224745        -0.654654      -0.654654

In [24]:
data.sort_values("Salary", ascending=False)

   Country   Age   Salary Purchased
8  Germany  50.0  83000.0        No
7   France  48.0  79000.0       Yes
0   France  44.0  72000.0        No
9   France  37.0  67000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
2  Germany  30.0  54000.0        No
6    Spain  38.0  52000.0        No
1    Spain  27.0  48000.0       Yes

# What we have learned?
- load data from a file to DataFrame
- create a DataFrame from python list/map
- how to pass column names to dataframe
- select columns using column name
- select columsn using row indexes
- handle NaN using inputation
- drop NaN from data
- aggregate data on single and multiple columns
- aggregate by multiple fields
- apply function on single column and entire row
- sort dataframe